const recommendations: Common.RecommendationType[] = [
  {
    title: "빅픽처팀 프론트엔드 개발자 김민수님",
    link: "https://github.com/minsoo-web",
    description: `찬혁님은 제가 아는 모든 프론트엔드, 나아가 개발자들 중에서 가장 지식 욕구가 강한 사람입니다. 

개발자가 지녀야할 가장 기본적인 소양 중 베이스라 할 수 있는 강한 지식 욕구를 새로운 지식에 대한 끊임 없는 도전과 탐구를 통해 해결합니다. 

자신이 작업한 프로젝트에 대한 자부심과 코드 품질에 대한 깊은 고민을 하는 모습은 어느 개발자를 옆에 두더라도 자극을 받게 해주는 절대 고이지 않는 계곡물 같은 사람입니다. 항상 새로운 시각을 제시하고, 팀원에게 칭찬과 격려를 아끼지 않는 모습은 앞으로의 찬혁님을 더 궁금하게 해주는 것 같습니다. 

앞으로의 성장이 궁금한 사람과 일을 하고 싶다면, 찬혁님을 추천합니다.

찬혁님은 정말 ‘잘’하는 개발자입니다.

저는 잘하는 개발자가 어떤 개발자냐, 라는 질문을 받으면 찬혁님을 생각하며 찬혁님의 특징을 하나하나 되짚습니다. 

기능 구현이나 결과물을 만드는 데에만 급급한 것이 아닌, 실제 사용하는 사용자의 경험을 생각하는 개발자
버그가 없는 코드를 작성하는 것에만 집중하는 것이 아닌, 유지보수와 그 코드를 읽을 개발자의 개발자 경험을 생각하는 개발자
자신이 잘하는 기술 스택에 목메는 것이 아닌, 필요한 기술 스택을 선택해서 스터디하고 도입하는 개발자

잘하는 개발자와 일을 하고 싶다면, 찬혁님을 추천합니다.

찬혁님은 ‘찬혁님이라면,’ 이라는 수식어가 참 잘 어울리는 사람입니다.

찬혁님이라면, 어떤 프로젝트를 맡기더라도 안정감 있게 잘 해결해줄 거라는 믿음을 주는 사람입니다. 
찬혁님이라면, 이 코드를 짠 이유가 있을 거라는 믿음을 주는 사람입니다.
찬혁님이라면 어떻게 이걸 해결할지가 궁금한 사람입니다. 
찬혁님이라면, 어떤 회사, 어떤 팀을 가더라도 잘 융화되어 팀원간의 화합을 돈독하게 할 수 있는 사람입니다. 

믿음을 줄 수 있는 팀원과 일을 하고 싶다면, 찬혁님을 추천합니다.
        `
  },
  {
    title: "빅픽처팀 프론트엔드 개발자 하정원님",
    link: "https://github.com/JayeHa",
    description: `저는 빅픽처팀에서 박찬혁님과 함께 일했던 프론트엔드 개발자로서 찬혁님과 함께 일하는 것을 적극적으로 추천합니다.

찬혁님은 개발경력이 믿기지 않을 정도로 높은 퀄리티의 코드를 빠른 속도로 해나가는 뛰어난 실력을 가진 개발자입니다.
이러한 모습에 회사내부에서는 찬혁님을 일명 "박프로"님으로 부르곤 했습니다.
    
찬혁님과 함께 일하며 옆에서 지켜본 결과 이렇게 빠른 속도로 성장해나가실 수 있었던 이유는 "이유없는 코드는 없다"는 찬혁님의 좌우명처럼 코드 한 줄을 쓸 때에도 항상 고민하는 습관을 가지신 덕분인 것 같습니다. 외부 api나 라이브러리를 사용할 때도 공식문서만 보는 것이 아니라 직접 해당 레포지토리로 가서 코드를 꼼꼼하게 살펴보는 습관을 가지셨으며 이를 통해 다양한 오픈소스에도 많은 기여를 하셨습니다.
    
뛰어난 협업능력으로 사내 코드리뷰 문화에도 많은 기여를 하셨으며, 리뷰어로서 다정한 말투로 꼼꼼하게 코멘트를 남기며 리뷰이로서 열린 자세로 피드백을 수용하는 찬혁님의 모습에 많은 것을 배울 수 있었고, 이에 감사하는 마음을 가지고 있습니다.
이렇게 고마움과 함께 아쉬운 마음을 담아 다음에도 꼭 찬혁님과 함께 일할 수 있는 기회가 있기를 소망하며 이만 글을 마치겠습니다.
세계를 무대로 다시 만나요! ㅎㅎ
        `
  }
];

export default recommendations;
